# Data Analysis with Sakila Database

In [13]:
import pandas as pd
import sqlite3

%matplotlib inline

## Loading Data:

In [14]:
conn = sqlite3.connect('data/sakila.db')

df = pd.read_sql('''
    SELECT
        rental.rental_id, rental.rental_date, rental.return_date,
        customer.last_name AS customer_lastname,
        store.store_id,
        city.city AS rental_store_city,
        film.title AS film_title, film.rental_duration AS film_rental_duration,
        film.rental_rate AS film_rental_rate, film.replacement_cost AS film_replacement_cost,
        film.rating AS film_rating
    FROM rental
    INNER JOIN customer ON rental.customer_id == customer.customer_id
    INNER JOIN inventory ON rental.inventory_id == inventory.inventory_id
    INNER JOIN store ON inventory.store_id == store.store_id
    INNER JOIN address ON store.address_id == address.address_id
    INNER JOIN city ON address.city_id == city.city_id
    INNER JOIN film ON inventory.film_id == film.film_id
    ;
''', conn, index_col='rental_id', parse_dates=['rental_date', 'return_date'])

## The data at a glance:

In [15]:
df.head()

,rental_date,return_date,customer_lastname,store_id,rental_store_city,film_title,film_rental_duration,film_rental_rate,film_replacement_cost,film_rating
rental_id,,,,,,,,,,
1,2005-05-24 22:53:30,2005-05-26 22:04:30,HUNTER,1,Lethbridge,BLANKET BEVERLY,7,2.99,21.99,G
2,2005-05-24 22:54:33,2005-05-28 19:40:33,COLLAZO,2,Woodridge,FREAKY POCUS,7,2.99,16.99,R
3,2005-05-24 23:03:39,2005-06-01 22:12:39,MURRELL,2,Woodridge,GRADUATE LORD,7,2.99,14.99,G
4,2005-05-24 23:04:41,2005-06-03 01:43:41,PURDY,1,Lethbridge,LOVE SUICIDES,6,0.99,21.99,R
5,2005-05-24 23:05:21,2005-06-02 04:33:21,HANSEN,2,Woodridge,IDOLS SNATCHERS,5,2.99,29.99,NC-17

In [16]:
df.shape

(16044, 10)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16044 entries, 1 to 16049
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   rental_date            16044 non-null  datetime64[ns]
 1   return_date            15861 non-null  datetime64[ns]
 2   customer_lastname      16044 non-null  object
 3   store_id               16044 non-null  int64
 4   rental_store_city      16044 non-null  object
 5   film_title             16044 non-null  object
 6   film_rental_duration   16044 non-null  int64
 7   film_rental_rate       16044 non-null  float64
 8   film_replacement_cost  16044 non-null  float64
 9   film_rating            16044 non-null  object
dtypes: datetime64[ns](2), float64(2), int64(2), object(4)
memory usage: 1.3+ MB

In [18]:
df.describe()

,store_id,film_rental_duration,film_rental_rate,film_replacement_cost
count,16044.000000,16044.00000,16044.000000,16044.000000
mean,1.506171,4.93549,2.942630,20.215443
std,0.499978,1.40169,1.649678,6.081771
min,1.000000,3.00000,0.990000,9.990000
25%,1.000000,4.00000,0.990000,14.990000
50%,2.000000,5.00000,2.990000,20.990000
75%,2.000000,6.00000,4.990000,25.990000
max,2.000000,7.00000,4.990000,29.990000

## Column wrangling
We can also create new columns or modify existing ones.
### Add and calculate a new `rental_rate_return` column
We want to know the rental rate of return of each film. To do that we'll use this formula:
$$ rental\_gain\_return = \frac{film\_rental\_rate}{film\_replacement\_cost} * 100 $$

In [19]:
df['rental_gain_return'] = df['film_rental_rate'] / df['film_replacement_cost'] * 100
df['rental_gain_return'].head(10)

rental_id
1     13.597090
2     17.598587
3     19.946631
4      4.502046
5      9.969990
6      4.952476
7      7.621247
8     16.638880
9     49.949950
10    26.276988
Name: rental_gain_return, dtype: float64

## Selection and Indexing
Get the rental records of the costumer_lasname HANSEN

In [20]:
df.loc[df['customer_lastname'] == 'HANSEN']

,rental_date,return_date,customer_lastname,store_id,rental_store_city,film_title,film_rental_duration,film_rental_rate,film_replacement_cost,film_rating,rental_gain_return
rental_id,,,,,,,,,,,
5,2005-05-24 23:05:21,2005-06-02 04:33:21,HANSEN,2,Woodridge,IDOLS SNATCHERS,5,2.99,29.99,NC-17,9.969990
134,2005-05-25 21:48:41,2005-06-02 18:28:41,HANSEN,2,Woodridge,JUMPING WRATH,4,0.99,18.99,NC-17,5.213270
416,2005-05-27 15:02:10,2005-05-29 10:34:10,HANSEN,2,Woodridge,LESSON CLEOPATRA,3,0.99,28.99,NC-17,3.414971
809,2005-05-29 19:10:20,2005-06-05 19:05:20,HANSEN,2,Woodridge,INDIAN LOVE,4,0.99,26.99,NC-17,3.668025
1006,2005-05-31 00:57:08,2005-06-02 22:35:08,HANSEN,2,Woodridge,SALUTE APOLLO,4,2.99,29.99,R,9.969990
1368,2005-06-15 14:27:47,2005-06-23 18:07:47,HANSEN,1,Lethbridge,HUNCHBACK IMPOSSIBLE,4,4.99,28.99,PG-13,17.212832
2603,2005-06-19 06:21:25,2005-06-26 03:19:25,HANSEN,2,Woodridge,CAT CONEHEADS,5,4.99,14.99,G,33.288859
5209,2005-07-09 11:22:39,2005-07-17 09:31:39,HANSEN,1,Lethbridge,WHALE BIKINI,4,4.99,11.99,PG-13,41.618015
5266,2005-07-09 14:17:40,2005-07-16 10:42:40,HANSEN,2,Woodridge,LOATHING LEGALLY,4,0.99,29.99,R,3.301100
5592,2005-07-10 04:26:13,2005-07-19 02:32:13,HANSEN,2,Woodridge,LUKE MUMMY,5,2.99,21.99,NC-17,13.597090
5635,2005-07-10 06:28:39,2005-07-17 08:35:39,HANSEN,2,Woodridge,FISH OPUS,4,2.99,22.99,R,13.005655
6129,2005-07-11 08:15:09,2005-07-18 13:00:09,HANSEN,2,Woodridge,STOCK GLASS,7,2.99,10.99,PG,27.206551
6497,2005-07-12 03:04:29,2005-07-17 21:36:29,HANSEN,2,Woodridge,DANCING FEVER,6,0.99,25.99,G,3.809157
7786,2005-07-28 07:18:26,2005-07-29 03:00:26,HANSEN,2,Woodridge,KARATE MOON,4,0.99,21.99,PG-13,4.502046
8300,2005-07-29 02:57:59,2005-08-05 01:12:59,HANSEN,2,Woodridge,VOYAGE LEGALLY,6,0.99,28.99,PG-13,3.414971
8597,2005-07-29 12:55:55,2005-08-05 18:54:55,HANSEN,1,Lethbridge,TUXEDO MILE,3,2.99,24.99,R,11.964786
8787,2005-07-29 20:43:49,2005-07-31 15:15:49,HANSEN,2,Woodridge,LEGALLY SECRETARY,7,4.99,14.99,PG,33.288859
10043,2005-07-31 19:02:07,2005-08-07 17:58:07,HANSEN,2,Woodridge,MARS ROMAN,6,0.99,21.99,NC-17,4.502046
12179,2005-08-18 01:21:21,2005-08-19 00:59:21,HANSEN,2,Woodridge,FOREVER CANDIDATE,7,2.99,28.99,NC-17,10.313901
13477,2005-08-20 01:07:00,2005-08-26 02:47:00,HANSEN,2,Woodridge,FINDING ANACONDA,4,0.99,10.99,R,9.008189
14350,2005-08-21 08:58:38,2005-08-30 03:29:38,HANSEN,1,Lethbridge,PRIMARY GLASS,7,0.99,16.99,G,5.826957

### Create a list of all the films w/the highest replacement_cost

In [21]:
df.loc[df['film_replacement_cost'] == df['film_replacement_cost'].max(), 'film_title'].unique()

array(['IDOLS SNATCHERS', 'LAWLESS VISION', 'SONG HEDWIG',
       'LOATHING LEGALLY', 'PATIENT SISTER', 'RESERVOIR ADAPTATION',
       'JEEPERS WEDDING', 'GOLDFINGER SENSIBILITY', 'CHARIOTS CONSPIRACY',
       'HONEY TIES', 'GRAFFITI LOVE', 'SLACKER LIAISONS', 'DIRTY ACE',
       'BLINDNESS GUN', 'WYOMING STORM', 'FEUD FROGMEN', 'SALUTE APOLLO',
       'JINGLE SAGEBRUSH', 'HILLS NEIGHBORS', 'UNCUT SUICIDES',
       'EVERYONE CRAFT', 'FLATLINERS KILLER', 'BALLROOM MOCKINGBIRD',
       'RIVER OUTLAW', 'ARABIA DOGMA', 'VIRGIN DAISY', 'JERICHO MULAN',
       'SASSY PACKER', 'TRACY CIDER', 'LOVER TRUMAN', 'DOCTOR GRAIL',
       'GILMORE BOILED', 'PRINCESS GIANT', 'CRUELTY UNFORGIVEN',
       'REIGN GENTLEMEN', 'WEST LION', 'BONNIE HOLOCAUST', 'EARTH VISION',
       'RANDOM GO', 'CLOCKWORK PARADISE', 'FANTASIA PARK', 'RIGHT CRANES',
       'CUPBOARD SINNERS', 'OSCAR GOLD', 'SMILE EARRING',
       'HOLLYWOOD ANONYMOUS', 'POSEIDON FOREVER',
       'EXTRAORDINARY CONQUERER', 'QUEST MUSSOLINI', 'JAPANESE RUN',
       'CLYDE THEORY', 'DESPERATE TRAINSPOTTING'], dtype=object)

### How many PG or PG-13 rating films were rented?

In [25]:
df.loc[(df['film_rating'] == 'PG') | (df['film_rating'] == 'PG-13')].shape[0]

6797